from enum import Flag


"""Реализуйте класс OrderStatus , описывающий флаг с состояниями интернет-
заказов. Флаг должен иметь три элемента:
•ORDER_PLACED
•PAYMENT_RECEIVED
•SHIPPING_COMPLETE
Примечание 1. Дополнительная проверка данных на корректность не требуется.
Гарантируется, что реализованный класс используется только с корректными
данными.
Примечание 2. Никаких ограничений касательно реализации
класса OrderStatus нет, она может быть произвольной."""


class OrderStatus(Flag):
    ORDER_PLACED = 1
    PAYMENT_RECEIVED = 2
    SHIPPING_COMPLETE = 4
